In [1]:
import pandas as pd

In [2]:
pip install pandas

Requirement already satisfied: pandas in /opt/conda/lib/python3.10/site-packages (1.5.2)
Requirement already satisfied: python-dateutil>=2.8.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2022.6)
Requirement already satisfied: numpy>=1.21.0 in /opt/conda/lib/python3.10/site-packages (from pandas) (1.23.5)
Requirement already satisfied: six>=1.5 in /opt/conda/lib/python3.10/site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [5]:
#Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.
import pandas as pd 
data =pd.Series([4, 8, 15, 16, 23, 42])
print(data)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [6]:
type(data)

pandas.core.series.Series

In [12]:
#Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
#variable print it.
import pandas as pd 
list=[1,2,3,4,5,6,7,8,9,10]
data1=pd.Series(list)
print(data1)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [23]:
#Q3. Create a Pandas DataFrame that contains the following data:
import pandas as pd

data = {'Name':['Alice','Bob','Clare'],

          'Age':[25,30,27],

        'Gender':['Female','Male','Female']}
df = pd.DataFrame(data)

print(df)

    Name  Age  Gender
0  Alice   25  Female
1    Bob   30    Male
2  Clare   27  Female

In [ ]:
#What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.
A DataFrame in pandas is a two-dimensional labeled data structure that is used to represent tabular data. It consists of rows and columns, where each column can have a different data type. A DataFrame is similar to a spreadsheet or a SQL table, and is one of the most commonly used data structures in data analysis and manipulation using pandas.

On the other hand, a Series in pandas is a one-dimensional labeled array that can hold data of any type. It is similar to a list or a 1D numpy array, but with the added functionality of labeled indexing. A Series can be thought of as a single column in a DataFrame.

In [24]:
#Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
#you give an example of when you might use one of these functions?
#Ans:head() and tail(): Returns the first or last n rows of a DataFrame, respectively. These functions are useful for quickly 
#inspecting the data and getting a sense of what it looks like.

describe(): Returns a statistical summary of the DataFrame, including count, mean, standard deviation, minimum and maximum 
values, and quartiles. This function is useful for quickly getting a sense of the distribution of the data.

data = {'Name':['Alice','Bob','Clare'],

          'Age':[25,30,27],

        'Gender':['Female','Male','Female']}
df = pd.DataFrame(data)

print(df)

    Name  Age  Gender
0  Alice   25  Female
1    Bob   30    Male
2  Clare   27  Female

    Name  Age  Gender
1    Bob   30    Male
2  Clare   27  Female

In [25]:
df.head(2)

    Name  Age  Gender
0  Alice   25  Female
1    Bob   30    Male

In [26]:
df.tail(2)

    Name  Age  Gender
1    Bob   30    Male
2  Clare   27  Female

In [27]:
print(df.describe())

             Age
count   3.000000
mean   27.333333
std     2.516611
min    25.000000
25%    26.000000
50%    27.000000
75%    28.500000
max    30.000000

In [29]:
df_grouped = df.groupby('Age')['Gender']
print(df_grouped)

<pandas.core.groupby.generic.SeriesGroupBy object at 0x7f5ed7e3c2e0>

In [ ]:
#Q6. Which of the following is mutable in nature Series, DataFrame, Panel?
In Pandas, Series and DataFrame are mutable in nature, which means that you can modify their contents after they have been created.

On the other hand, Panel is no longer recommended to be used in Pandas, as it has been deprecated since version 0.25.0 and replaced by other data structures like MultiIndex and xarray. However, for the record, Panel is also mutable in nature.

In [ ]:
Q7. Create a DataFrame using multiple Series. Explain with an example.
To create a DataFrame using multiple Series, we can first create each Series individually, and then use the pd.concat() 
function to concatenate them along either the rows or columns axis.

In [30]:
import pandas as pd

# Create three Series containing some data
s1 = pd.Series([1, 2, 3, 4])
s2 = pd.Series(['a', 'b', 'c', 'd'])
s3 = pd.Series([True, False, True, False])

# Concatenate the Series along the columns axis to create a DataFrame
df = pd.concat([s1, s2, s3], axis=1)
print(df)

   0  1      2
0  1  a   True
1  2  b  False
2  3  c   True
3  4  d  False